import './CompanyContent.css'
import React from 'react'

export const Service = ()=>{
    return(
        <>
            <div className="content-company">
                <div className="content-company-topic">
                    ข้อตกลงและเงื่อนไขการบริการ
                </div>
                <div className="content-company-detail">
                    ข้อตกลงและเงื่อนไขการบริการระบุไว้ต่อไปนี้  เป็นข้อตกลงระหว่าง maNakhon.com กับลูกค้า โดยทั้งสองฝ่ายตกลงตามข้อตกลงและเงื่อนไขในการซื้อสินค้าออนไลน์(ข้อตกลง) ฉบับนี้ด้วย
                </div>
                <div className="content-company-detail">
                    <big>1. คำนิยาม</big><br /><br />
                    <ul>
                        <li>“maNakhon.com”         หมายถึง maNakhon.com ผู้ให้บริการขายสินค้าออนไลน์</li>
                        <li>“ลูกค้า”          หมายถึง บุคคล, นิติบุคคล, บริษัท, ห้างหุ้นส่วน หรือ หน่วยงานใดที่ทำคำสั่งซื้อหรือรับบริการกับ maNakhon.com</li>
                        <li>“สินค้า”          หมายถึง ผลิตภัณฑ์ หรือ บริการอื่นๆ ที่maNakhon.comจำหน่ายบนเว็บไซด์นี้</li>
                        <li>“เว็บไซด์”       หมายถึง เว็บไซด์    “www.maNakhon.com”</li>
                        <li>“ราคาสินค้า”   หมายถึง ราคาสินค้าก่อนหักส่วนลด หรือราคาสินค้าที่อยู่ในโปรโมชั่นการลดราคาโดยไม่รวมค่าขนส่ง</li>
                        <li>“ส่วนลด”        หมายถึง ส่วนลดจากราคาสินค้า หรือจากคะแนนสะสม หรือจากคูปองส่วนลด หรือจากรายการส่งเสริมทางการตลาดของmaNakhon.com</li>
                        <li>“คู่สัญญา”       หมายถึง maNakhon.com กับ ลูกค้า</li><br /><br />
                    </ul>
                </div>
                <div className="content-company-detail">    
                    <big>2. ข้อตกลงทั่วไป</big><br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;2.1. maNakhon.comสงวนสิทธิ์ในการแก้ไขเปลี่ยนแปลงข้อตกลงฉบับนี้  ตลอดจนเงื่อนไขการรับประกันสินค้า และรายละเอียดต่างๆที่อาจเกิดขึ้นในอนาคต โดยไม่จำต้องแจ้งให้ลูกค้าทราบล่วงหน้า<br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;2.2. การใช้งานเว็บไซด์นี้ไม่ว่าทั้งหมดหรือบางส่วนอย่างต่อเนื่อง หรือเพียงบางขณะ  ถือว่าลูกค้ารับทราบและตกลงตามข้อตกลงฉบับนี้ทุกประการ หากลูกค้าไม่เห็นด้วยตามข้อตกลงฉบับนี้รวมตลอดถึงข้อตกลงที่แก้ไขใหม่ ลูกค้าสามารถยุติการใช้งานเว็บไซด์นี้ได้ตลอดเวลา<br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;2.3. ข้อตกลงฉบับนี้ ถือเป็นสัญญาซื้อขายสินค้าและ/หรือผลิตภัณฑ์ และ/หรือบริการ ระหว่าง maNakhon.com กับลูกค้า โดยถือตามรายละเอียดที่ปรากฏตามข้อตกลงนี้ หากข้อตกลงระหว่าง maNakhon.com กับลูกค้าข้อใดขัดแย้ง หรือแตกต่างจากข้อตกลงนี้ maNakhon.com กับลูกค้าตกลงยึดถือตามข้อตกลงนี้เป็นหลัก<br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;2.4. ในการเข้าใช้บริการเว็บไซด์นี้ maNakhon.comสงวนสิทธิ์ปฏิเสธการขายสินค้า กับบุคคลที่อายุต่ำกว่า 18 ปี และ/หรือลูกค้าที่เป็นบุคคลวิกลจริต หรือเป็นผู้หย่อนความสามารถในการทำนิติกรรมได้ตามกฎหมาย<br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;2.5. เมื่อลูกค้าเข้าใช้บริการเว็บไซด์นี้ maNakhon.com ถือว่าลูกค้ายอมรับข้อตกลงและข้อตกลงนี้ทุกประการ  และลูกค้ายินยอมให้ maNakhon.com ดำเนินการจัดการข้อมูลของลูกค้าได้  ไม่ว่าลูกค้าจะได้ทำการลงทะเบียนในขณะเข้าใช้เว็บไซด์ก่อนหรือไม่ก็ตาม<br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;2.6. การทำคำสั่งซื้อ และ/หรือการปฏิเสธ และ/หรือการยกเลิกสินค้า ถือเป็นการกระทำโดยลูกค้า ลูกค้าย่อมผูกพันตามคำสั่งดังกล่าวทุกประการ<br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;2.7. maNakhon.com ได้ตรวจสอบความถูกต้องของสินค้า  ข้อมูลสินค้า  ภาพถ่ายของสินค้า ที่ปรากฏในแคตตาล็อค หรือคำบรรยายในเว็บไซด์  หากมีข้อผิดพลาดอันอาจเกิดจากการจัดพิมพ์  สี  หรือจากการบรรจุภัณฑ์  maNakhon.com ถือเป็นเพียงการนำเสนอเบื้องต้นเพื่อเป็นแนวทางให้แก่ลูกค้าเท่านั้น  maNakhon.com ไม่ถือว่าข้อผิดพลาดดังกล่าว  เป็นข้อตกลงในการซื้อขาย
                </div>
                <div className="content-company-detail">
                    <big>3. ทรัพย์สินทางปัญญา</big><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;3.1. ลูกค้ารับทราบและเข้าใจเป็นอย่างดีว่า บรรดาข้อมูล ข่าวสาร ภาพ ภาพถ่าย ซอฟแวร์ แบบอักษร รูปแบบของเว็บไซด์ และสื่ออื่นๆ ได้รับความคุ้มครองตามกฎหมายเกี่ยวกับทรัพย์สินทางปัญญา  ลิขสิทธิ์  หรือตามกฎหมายอื่นที่เกี่ยวข้อง  ลูกค้าตกลงจะไม่ทำการคัดลอก ปรับเปลี่ยน แก้ไข เพิ่มเติมข้อมูล หรือกระทำการอื่นใดอันเป็นการละเมิดทรัพย์สินทางปัญญาอันเกี่ยวกับสินค้า 
                    และ/หรือผิดต่อกฎหมาย โดยไม่ได้รับอนุญาตจาก maNakhon.com หากลูกค้าละเมิดข้อตกลงนี้ maNakhon.com มีสิทธิเรียกร้องค่าเสียหาย และ/หรือให้ลูกค้ากระทำการอย่างใดตามที่ maNakhon.com เห็นสมควร โดยลูกค้ายินยอมจะไม่ใช้สิทธิ์โต้แย้งใดๆทั้งสิ้น<br /><br />
                </div>
                <div className="content-company-detail">
                    <big>4. ราคาสินค้า  และการชำระเงิน</big><br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;4.1. สินค้า รายละเอียดของสินค้า  ราคา  และขนาดของผลิตภัณฑ์  ที่ปรากฏบนเว็บไซด์นี้ maNakhon.com ขอสงวนสิทธิ์ในการเปลี่ยนแปลงโดยไม่จำต้องแจ้งให้ลูกค้าทราบล่วงหน้า<br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;4.2. สินค้าที่แสดงอยู่ในเว็บไซด์  หากสินค้าหมดเป็นครั้งคราว หรือไม่มีสินค้า  maNakhon.com ขอสงวนสิทธิ์ในการเก็บคำสั่งซื้อของลูกค้าไว้จนกว่าสินค้าที่ลูกค้าสั่งซื้อมีอยู่ในสต็อกของ maNakhon.com  หรือ maNakhon.com และลูกค้าจะได้ตกลงกันเป็นอย่างอื่น<br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;4.3. รูปภาพและข้อมูลของสินค้าทั้งหมดที่แสดงทางเว็บไซด์นี้ เป็นการจัดแสดงไว้ตามสภาพที่เป็นอยู่  และใช้เพียงเพื่อวัตถุประสงค์ในการแสดงให้ลูกค้าทราบถึงลักษณะสินค้าเท่านั้น  ขนาด  คุณภาพ  ความสูง  และสี  ของสินค้าที่แท้จริงอาจจะแตกต่างจากที่ปรากฏบนเว็บไซด์<br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;4.4. เมื่อลูกค้าทำคำสั่งซื้อสินค้าจนครบขั้นตอนตามที่ระบุในเว็บไซด์แล้วถือว่าคำสั่งซื้อดังกล่าวเป็นเพียงคำเสนอซื้อของลูกค้าเท่านั้น  maNakhon.comยังไม่มีหน้าที่จัดหาสินค้าให้กับลูกค้าจนกว่า maNakhon.com จะได้ทำการตอบตกลง หรือตอบรับคำสั่งซื้อของลูกค้าเรียบร้อยแล้วเท่านั้น<br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;4.5. maNakhon.com อาจยกเลิกคำสั่งซื้อของลูกค้า  หากปรากฏว่าสินค้าไม่มี  หรือเลิกทำการผลิต  หรือเหตุอื่นใดก็ตาม  ที่ทำให้ maNakhon.com ไม่สามารรถตอบรับคำสั่งซื้อกับลูกค้าได้  โดย maNakhon.com จะแจ้งถึงปัญหาดังกล่าวให้ลูกค้าทราบ เพื่อทำการคืนเงิน หรือจัดหาสินค้าอื่นเป็นการทดแทนให้กับลูกค้าต่อไปตามระบบ
                </div>
                <div className="content-company-detail">
                    <big>5. การชำระเงิน</big><br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;5.1. ราคาสินค้าที่ได้ตกลงทำการซื้อขายและ/หรือรับบริการ  จะถือเป็นราคาแน่นอนก็ต่อเมื่อลูกค้าทำคำสั่งซื้อจนครบขั้นตอนแล้วเสร็จเป็นสำคัญ ลูกค้าสามารถชำระเงินได้ตามช่องทางดังต่อไปนี้<br />
                    <ul>
                        <li>บัตรเครดิต บัตรเดบิต</li>
                        <li>ชำระเงินผ่านทางธนาคาร</li>
                        <li>อื่นๆ ตามเงื่อนไขที่ maNakhon.com กำหนด</li>
                    </ul>
                    &nbsp;&nbsp;&nbsp;&nbsp;5.2. กรณีที่ลูกค้าชำระเงินหักผ่านบัตรเครดิต หรือเดบิต ลูกค้าต้องชำระให้ครบถ้วนตรงตามข้อมูล รหัสสินค้า และจำนวนเงินครบถ้วนตามที่ปรากฏในเว็บไซด์  หากลูกค้าไม่ชำระเงินภายในระยะเวลาที่กำหนดหรือไม่ครบถ้วน  maNakhon.comขอสงวนสิทธิ์ที่จะยกเลิกคำสั่งซื้อของลูกค้า<br /><br />
                </div>
                <div className="content-company-detail">
                    <big>6. การส่งสินค้า</big><br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;6.1. สินค้าจะถูกจัดส่งไปยังลูกค้าตามที่อยู่ที่ลูกค้าได้ระบุไว้ทางเว็บไซด์เป็นสำคัญ โดย maNakhon.com อาจแจ้งถึงการจัดส่งสินค้าให้ลูกค้าทราบผ่านช่องทางอีเมลหรือ SMS และช่องทางอื่นๆที่ maNakhon.com กำหนด<br /><br />
                </div>
                <div className="content-company-detail">
                    <big>7. ข้อกำหนดความรับผิดชอบ</big><br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;7.1. maNakhon.com จะไม่รับผิดชอบในความสูญหายหรือความเสียหายใดๆภายหลังจากที่สินค้าหรือบริการได้มีการส่งมอบให้แก่ลูกค้าแล้ว<br /><br />
                    &nbsp;&nbsp;&nbsp;&nbsp;7.2. รูปภาพและข้อมูลของสินค้าทั้งหมดที่แสดงทางเว็บไซด์นี้  เป็นการจัดแสดงไว้ตามสภาพที่เป็นอยู่  ไม่เป็นการรับประกันสินค้าหรือบริการในรูปแบบใดไม่ว่าโดยชัดแจ้งหรือโดยปริยาย<br />
                </div>
            </div>
        </>
    )
}

export default Service